# Создать пустую папку
# Открыть ее в вашем IDE
# Установить 2 виртуальных окружения

# python -m venv venv
# python -m venv venv2


# Активировать 1 скачать туда несколько зависимостей с сайта https://pypi.org/

# venv\Scripts\activate

# pip install colorama
# pip install flask

# Вывести все зависимости в txt файл

# pip freeze > requirements.txt

# Удалить его

# Удалил окружение вручную

# Активировать 2 виртуальное окружение

# venv2\Scripts\activate

# И скачать все зависимости которые есть в txt file

# pip install -r requirements.txt

# Запушить на новый репозиторий
#
# Extra task
# (Выполнять не обязательно но если есть ошибки в дз смотрится выполнения Extra taskа)
# Создать новый проект
# И подключить туда виртуальное окружение другого проекта который вы недавно создали
# Вывести все зависимости
# Создать новый репозиторий и отправить мне